[Killed] StringLiteral
Development/Sastantua/src/Sastantua.ts:2:29
 export class Sastantua {
-	private NEW_LINE: string = '\n'
+	private NEW_LINE: string = ""
 	private LEFT_SLOPE: string = '/'
 	private RIGHT_SLOPE: string = '\\'

[Killed] StringLiteral
Development/Sastantua/src/Sastantua.ts:7:25
 	private RIGHT_SLOPE: string = '\\'
 	private BRICK: string = '*'
 	private SPACE: string = ' '
-	private DOOR: string = '|'
+	private DOOR: string = ""
 	private TOP_FLOOR_HEIGHT: number = 3
 	private EMPTY_STRING = ''

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:19:24
 	private generateRegularFloors(pyramidSize: number) {
 		let lines = this.EMPTY_STRING
 		let lineNumber = 1
-		for (let floor = 1 ; floor <= pyramidSize - 1 ; floor++) {
+		for (let floor = 1 ; false ; floor++) {
 			let _ret = this.generateRegularLines(floor, pyramidSize, lineNumber--)
 			lineNumber = _ret.lineNumber

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:19:45
 	private generateRegularFloors(pyramidSize: number) {
 		let lines = this.EMPTY_STRING
 		let lineNumber = 1
-		for (let floor = 1 ; floor <= pyramidSize - 1 ; floor++) {
+		for (let floor = 1 ; floor <= pyramidSize + 1 ; floor++) {
 			let _ret = this.generateRegularLines(floor, pyramidSize, lineNumber--)
 			lineNumber = _ret.lineNumber

[Survived] UpdateOperator
Development/Sastantua/src/Sastantua.ts:20:61
 		let lines = this.EMPTY_STRING
 		let lineNumber = 1
 		for (let floor = 1 ; floor <= pyramidSize - 1 ; floor++) {
-			let _ret = this.generateRegularLines(floor, pyramidSize, lineNumber--)
+			let _ret = this.generateRegularLines(floor, pyramidSize, lineNumber++)
 			lineNumber = _ret.lineNumber
 			lines += _ret.lines

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:22:4
 		for (let floor = 1 ; floor <= pyramidSize - 1 ; floor++) {
 			let _ret = this.generateRegularLines(floor, pyramidSize, lineNumber--)
 			lineNumber = _ret.lineNumber
-			lines += _ret.lines
+			false
 		}
 		return { lines, lineNumber }

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:22:4
 		for (let floor = 1 ; floor <= pyramidSize - 1 ; floor++) {
 			let _ret = this.generateRegularLines(floor, pyramidSize, lineNumber--)
 			lineNumber = _ret.lineNumber
-			lines += _ret.lines
+			true
 		}
 		return { lines, lineNumber }

[Killed] BlockStatement
Development/Sastantua/src/Sastantua.ts:29:91
 
 	private generateRegularLines(currentFloor: number, pyramidSize: number, lineNumber: number) {
 		let lines = this.EMPTY_STRING
-		for (let linesToBuild = this.getHeightOf(currentFloor) ; linesToBuild ; linesToBuild--) {
-			let neededElements =
-				this.getNeededElements(lineNumber++, pyramidSize, linesToBuild, currentFloor, LineType.REGULAR)
-			lines += this.buildLine(LineType.REGULAR, neededElements)
-		}
+		for (let linesToBuild = this.getHeightOf(currentFloor) ; linesToBuild ; linesToBuild--) {}
 		return { lines, lineNumber }
 	}

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:29:60
 
 	private generateRegularLines(currentFloor: number, pyramidSize: number, lineNumber: number) {
 		let lines = this.EMPTY_STRING
-		for (let linesToBuild = this.getHeightOf(currentFloor) ; linesToBuild ; linesToBuild--) {
+		for (let linesToBuild = this.getHeightOf(currentFloor) ; false ; linesToBuild--) {
 			let neededElements =
 				this.getNeededElements(lineNumber++, pyramidSize, linesToBuild, currentFloor, LineType.REGULAR)

[Killed] UpdateOperator
Development/Sastantua/src/Sastantua.ts:31:28
 		let lines = this.EMPTY_STRING
 		for (let linesToBuild = this.getHeightOf(currentFloor) ; linesToBuild ; linesToBuild--) {
 			let neededElements =
-				this.getNeededElements(lineNumber++, pyramidSize, linesToBuild, currentFloor, LineType.REGULAR)
+				this.getNeededElements(lineNumber--, pyramidSize, linesToBuild, currentFloor, LineType.REGULAR)
 			lines += this.buildLine(LineType.REGULAR, neededElements)
 		}

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:32:4
 		for (let linesToBuild = this.getHeightOf(currentFloor) ; linesToBuild ; linesToBuild--) {
 			let neededElements =
 				this.getNeededElements(lineNumber++, pyramidSize, linesToBuild, currentFloor, LineType.REGULAR)
-			lines += this.buildLine(LineType.REGULAR, neededElements)
+			false
 		}
 		return { lines, lineNumber }

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:32:4
 		for (let linesToBuild = this.getHeightOf(currentFloor) ; linesToBuild ; linesToBuild--) {
 			let neededElements =
 				this.getNeededElements(lineNumber++, pyramidSize, linesToBuild, currentFloor, LineType.REGULAR)
-			lines += this.buildLine(LineType.REGULAR, neededElements)
+			true
 		}
 		return { lines, lineNumber }

[Killed] EqualityOperator
Development/Sastantua/src/Sastantua.ts:38:13
 	}
 
 	private getHeightOf(floor: number): number {
-		if (floor === 1)
+		if (floor !== 1)
 			return this.TOP_FLOOR_HEIGHT
 		return this.getHeightOf(floor - 1) + 1

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:38:7
 	}
 
 	private getHeightOf(floor: number): number {
-		if (floor === 1)
+		if (true)
 			return this.TOP_FLOOR_HEIGHT
 		return this.getHeightOf(floor - 1) + 1

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:40:33
 	private getHeightOf(floor: number): number {
 		if (floor === 1)
 			return this.TOP_FLOOR_HEIGHT
-		return this.getHeightOf(floor - 1) + 1
+		return this.getHeightOf(floor + 1) + 1
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:40:38
 	private getHeightOf(floor: number): number {
 		if (floor === 1)
 			return this.TOP_FLOOR_HEIGHT
-		return this.getHeightOf(floor - 1) + 1
+		return this.getHeightOf(floor - 1) - 1
 	}
 

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:50:7
 		currentFloor: number,
 		lineType: LineType
 	) {
-		if (lineType === LineType.DOOR) {
+		if (false) {
 			const doorNeededBySide = Math.floor(pyramidSize / 2)
 			return {

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:50:7
 		currentFloor: number,
 		lineType: LineType
 	) {
-		if (lineType === LineType.DOOR) {
+		if (true) {
 			const doorNeededBySide = Math.floor(pyramidSize / 2)
 			return {

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:51:52
 		lineType: LineType
 	) {
 		if (lineType === LineType.DOOR) {
-			const doorNeededBySide = Math.floor(pyramidSize / 2)
+			const doorNeededBySide = Math.floor(pyramidSize * 2)
 			return {
 				bricks: this.calculateNeededBricksForOneSide(line, currentFloor) - doorNeededBySide,

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:53:70
 		if (lineType === LineType.DOOR) {
 			const doorNeededBySide = Math.floor(pyramidSize / 2)
 			return {
-				bricks: this.calculateNeededBricksForOneSide(line, currentFloor) - doorNeededBySide,
+				bricks: this.calculateNeededBricksForOneSide(line, currentFloor) + doorNeededBySide,
 				spaces: this.calculateNeededOffset(lineHeightInFloor, currentFloor, pyramidSize),
 				door: doorNeededBySide,

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:66:32
 	}
 
 	private calculateNeededBricksForOneSide(line: number, currentFloor: number) {
-		const defaultTriangle = line - 1
+		const defaultTriangle = line + 1
 		return defaultTriangle + this.calculateSuperiorFloorsCumulatedOffset(currentFloor)
 	}

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:67:26
 
 	private calculateNeededBricksForOneSide(line: number, currentFloor: number) {
 		const defaultTriangle = line - 1
-		return defaultTriangle + this.calculateSuperiorFloorsCumulatedOffset(currentFloor)
+		return defaultTriangle - this.calculateSuperiorFloorsCumulatedOffset(currentFloor)
 	}
 

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:71:7
 	}
 
 	private calculateSuperiorFloorsCumulatedOffset(currentFloor: number): number {
-		if (currentFloor === 1)
+		if (true)
 			return 0
 		return this.getCurrentFloorOffset(currentFloor - 1)

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:71:7
 	}
 
 	private calculateSuperiorFloorsCumulatedOffset(currentFloor: number): number {
-		if (currentFloor === 1)
+		if (false)
 			return 0
 		return this.getCurrentFloorOffset(currentFloor - 1)

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:73:50
 	private calculateSuperiorFloorsCumulatedOffset(currentFloor: number): number {
 		if (currentFloor === 1)
 			return 0
-		return this.getCurrentFloorOffset(currentFloor - 1)
+		return this.getCurrentFloorOffset(currentFloor + 1)
 			+ this.calculateSuperiorFloorsCumulatedOffset(currentFloor - 1)
 	}

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:74:63
 		if (currentFloor === 1)
 			return 0
 		return this.getCurrentFloorOffset(currentFloor - 1)
-			+ this.calculateSuperiorFloorsCumulatedOffset(currentFloor - 1)
+			+ this.calculateSuperiorFloorsCumulatedOffset(currentFloor + 1)
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:74:4
 		if (currentFloor === 1)
 			return 0
 		return this.getCurrentFloorOffset(currentFloor - 1)
-			+ this.calculateSuperiorFloorsCumulatedOffset(currentFloor - 1)
+			- this.calculateSuperiorFloorsCumulatedOffset(currentFloor - 1)
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:80:91
 	private calculateNeededOffset(lineHeightInFloor: number, currentFloor: number, pyramidSize: number): number {
 		const triangleOffsetByDefault = this.getDefaultTriangleOffset(lineHeightInFloor)
 		const offsetForNewFloor = this.calculateInferiorFloorsOffset(currentFloor, pyramidSize)
-		const offsetForInferiorFloorsLines = this.countInferiorFloorsLinesFromFloor(pyramidSize - 1, currentFloor - 1)
+		const offsetForInferiorFloorsLines = this.countInferiorFloorsLinesFromFloor(pyramidSize + 1, currentFloor - 1)
 		return triangleOffsetByDefault + offsetForInferiorFloorsLines + offsetForNewFloor
 	}

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:80:109
 	private calculateNeededOffset(lineHeightInFloor: number, currentFloor: number, pyramidSize: number): number {
 		const triangleOffsetByDefault = this.getDefaultTriangleOffset(lineHeightInFloor)
 		const offsetForNewFloor = this.calculateInferiorFloorsOffset(currentFloor, pyramidSize)
-		const offsetForInferiorFloorsLines = this.countInferiorFloorsLinesFromFloor(pyramidSize - 1, currentFloor - 1)
+		const offsetForInferiorFloorsLines = this.countInferiorFloorsLinesFromFloor(pyramidSize - 1, currentFloor + 1)
 		return triangleOffsetByDefault + offsetForInferiorFloorsLines + offsetForNewFloor
 	}

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:81:65
 		const triangleOffsetByDefault = this.getDefaultTriangleOffset(lineHeightInFloor)
 		const offsetForNewFloor = this.calculateInferiorFloorsOffset(currentFloor, pyramidSize)
 		const offsetForInferiorFloorsLines = this.countInferiorFloorsLinesFromFloor(pyramidSize - 1, currentFloor - 1)
-		return triangleOffsetByDefault + offsetForInferiorFloorsLines + offsetForNewFloor
+		return triangleOffsetByDefault + offsetForInferiorFloorsLines - offsetForNewFloor
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:81:34
 		const triangleOffsetByDefault = this.getDefaultTriangleOffset(lineHeightInFloor)
 		const offsetForNewFloor = this.calculateInferiorFloorsOffset(currentFloor, pyramidSize)
 		const offsetForInferiorFloorsLines = this.countInferiorFloorsLinesFromFloor(pyramidSize - 1, currentFloor - 1)
-		return triangleOffsetByDefault + offsetForInferiorFloorsLines + offsetForNewFloor
+		return triangleOffsetByDefault - offsetForInferiorFloorsLines + offsetForNewFloor
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:85:28
 	}
 
 	private getDefaultTriangleOffset(lineHeightInFloor: number) {
-		return lineHeightInFloor - 1
+		return lineHeightInFloor + 1
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:89:19
 	}
 
 	private calculateInferiorFloorsOffset(currentFloor: number, pyramidSize: number): number {
-		if (pyramidSize - currentFloor === 0)
+		if (pyramidSize + currentFloor === 0)
 			return 0
 		return this.getCurrentFloorOffset(currentFloor) + this.calculateInferiorFloorsOffset(currentFloor + 1, pyramidSize)

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:89:7
 	}
 
 	private calculateInferiorFloorsOffset(currentFloor: number, pyramidSize: number): number {
-		if (pyramidSize - currentFloor === 0)
+		if (false)
 			return 0
 		return this.getCurrentFloorOffset(currentFloor) + this.calculateInferiorFloorsOffset(currentFloor + 1, pyramidSize)

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:91:101
 	private calculateInferiorFloorsOffset(currentFloor: number, pyramidSize: number): number {
 		if (pyramidSize - currentFloor === 0)
 			return 0
-		return this.getCurrentFloorOffset(currentFloor) + this.calculateInferiorFloorsOffset(currentFloor + 1, pyramidSize)
+		return this.getCurrentFloorOffset(currentFloor) + this.calculateInferiorFloorsOffset(currentFloor - 1, pyramidSize)
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:91:51
 	private calculateInferiorFloorsOffset(currentFloor: number, pyramidSize: number): number {
 		if (pyramidSize - currentFloor === 0)
 			return 0
-		return this.getCurrentFloorOffset(currentFloor) + this.calculateInferiorFloorsOffset(currentFloor + 1, pyramidSize)
+		return this.getCurrentFloorOffset(currentFloor) - this.calculateInferiorFloorsOffset(currentFloor + 1, pyramidSize)
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:95:33
 	}
 
 	private getCurrentFloorOffset(currentFloor: number) {
-		return Math.ceil(currentFloor / 2) + 1
+		return Math.ceil(currentFloor * 2) + 1
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:95:38
 	}
 
 	private getCurrentFloorOffset(currentFloor: number) {
-		return Math.ceil(currentFloor / 2) + 1
+		return Math.ceil(currentFloor / 2) - 1
 	}
 

[Killed] EqualityOperator
Development/Sastantua/src/Sastantua.ts:99:13
 	}
 
 	private countInferiorFloorsLinesFromFloor(floor: number, to: number): number {
-		if (floor === to)
+		if (floor !== to)
 			return 0
 		return this.getFloorHeight(floor) + this.countInferiorFloorsLinesFromFloor(floor - 1, to)

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:99:7
 	}
 
 	private countInferiorFloorsLinesFromFloor(floor: number, to: number): number {
-		if (floor === to)
+		if (true)
 			return 0
 		return this.getFloorHeight(floor) + this.countInferiorFloorsLinesFromFloor(floor - 1, to)

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:101:37
 	private countInferiorFloorsLinesFromFloor(floor: number, to: number): number {
 		if (floor === to)
 			return 0
-		return this.getFloorHeight(floor) + this.countInferiorFloorsLinesFromFloor(floor - 1, to)
+		return this.getFloorHeight(floor) - this.countInferiorFloorsLinesFromFloor(floor - 1, to)
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:101:84
 	private countInferiorFloorsLinesFromFloor(floor: number, to: number): number {
 		if (floor === to)
 			return 0
-		return this.getFloorHeight(floor) + this.countInferiorFloorsLinesFromFloor(floor - 1, to)
+		return this.getFloorHeight(floor) + this.countInferiorFloorsLinesFromFloor(floor + 1, to)
 	}
 

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:105:32
 	}
 
 	private getFloorHeight(stage: number) {
-		return this.TOP_FLOOR_HEIGHT + stage
+		return this.TOP_FLOOR_HEIGHT - stage
 	}
 

[Killed] BlockStatement
Development/Sastantua/src/Sastantua.ts:108:70
 		return this.TOP_FLOOR_HEIGHT + stage
 	}
 
-	private generateFirstFloor(pyramidSize: number, lineNumber: number) {
-		let lines = this.EMPTY_STRING
-		const currentFloor = pyramidSize
-		let lineHeightInFloor = this.getHeightOf(currentFloor)
-
-		let neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
-		lines += this.buildLine(LineType.REGULAR, neededElements)
-		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
-		lines += this.buildLine(LineType.REGULAR, neededElements)
-
-		while (lineHeightInFloor) {
-			if (pyramidSize >= 5 && lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
-				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
-				lines += this.generateLockLine(neededElements)
-			}
-			else {
-				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
-				lines += this.generateDoorLines(neededElements)
-			}
-		}
-		return lines
-	}
+	private generateFirstFloor(pyramidSize: number, lineNumber: number) {}
 
 	private generateDoorLines(neededElements: Elements) {

[Killed] UpdateOperator
Development/Sastantua/src/Sastantua.ts:113:74
 		const currentFloor = pyramidSize
 		let lineHeightInFloor = this.getHeightOf(currentFloor)
 
-		let neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
+		let neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor++, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)
 		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)

[Killed] UpdateOperator
Development/Sastantua/src/Sastantua.ts:113:47
 		const currentFloor = pyramidSize
 		let lineHeightInFloor = this.getHeightOf(currentFloor)
 
-		let neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
+		let neededElements = this.getNeededElements(lineNumber--, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)
 		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:114:3
 		let lineHeightInFloor = this.getHeightOf(currentFloor)
 
 		let neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
-		lines += this.buildLine(LineType.REGULAR, neededElements)
+		true
 		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:114:3
 		let lineHeightInFloor = this.getHeightOf(currentFloor)
 
 		let neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
-		lines += this.buildLine(LineType.REGULAR, neededElements)
+		false
 		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)

[Killed] UpdateOperator
Development/Sastantua/src/Sastantua.ts:115:70
 
 		let neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)
-		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
+		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor++, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)
 

[Killed] UpdateOperator
Development/Sastantua/src/Sastantua.ts:115:43
 
 		let neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)
-		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
+		neededElements = this.getNeededElements(lineNumber--, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)
 

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:116:3
 		let neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)
 		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
-		lines += this.buildLine(LineType.REGULAR, neededElements)
+		true
 
 		while (lineHeightInFloor) {

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:116:3
 		let neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)
 		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
-		lines += this.buildLine(LineType.REGULAR, neededElements)
+		false
 
 		while (lineHeightInFloor) {

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:118:10
 		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)
 
-		while (lineHeightInFloor) {
+		while (false) {
 			if (pyramidSize >= 5 && lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
 				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)

[Timeout] BlockStatement
Development/Sastantua/src/Sastantua.ts:118:29
 		neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.REGULAR)
 		lines += this.buildLine(LineType.REGULAR, neededElements)
 
-		while (lineHeightInFloor) {
-			if (pyramidSize >= 5 && lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
-				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
-				lines += this.generateLockLine(neededElements)
-			}
-			else {
-				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
-				lines += this.generateDoorLines(neededElements)
-			}
-		}
+		while (lineHeightInFloor) {}
 		return lines
 	}

[Killed] LogicalOperator
Development/Sastantua/src/Sastantua.ts:119:25
 		lines += this.buildLine(LineType.REGULAR, neededElements)
 
 		while (lineHeightInFloor) {
-			if (pyramidSize >= 5 && lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
+			if (pyramidSize >= 5 || lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
 				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
 				lines += this.generateLockLine(neededElements)

[Killed] EqualityOperator
Development/Sastantua/src/Sastantua.ts:119:20
 		lines += this.buildLine(LineType.REGULAR, neededElements)
 
 		while (lineHeightInFloor) {
-			if (pyramidSize >= 5 && lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
+			if (pyramidSize < 5 && lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
 				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
 				lines += this.generateLockLine(neededElements)

[Killed] UpdateOperator
Development/Sastantua/src/Sastantua.ts:120:45
 
 		while (lineHeightInFloor) {
 			if (pyramidSize >= 5 && lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
-				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
+				neededElements = this.getNeededElements(lineNumber--, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
 				lines += this.generateLockLine(neededElements)
 			}

[Timeout] UpdateOperator
Development/Sastantua/src/Sastantua.ts:120:72
 
 		while (lineHeightInFloor) {
 			if (pyramidSize >= 5 && lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
-				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
+				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor++, currentFloor, LineType.DOOR)
 				lines += this.generateLockLine(neededElements)
 			}

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:121:5
 		while (lineHeightInFloor) {
 			if (pyramidSize >= 5 && lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
 				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
-				lines += this.generateLockLine(neededElements)
+				false
 			}
 			else {

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:121:5
 		while (lineHeightInFloor) {
 			if (pyramidSize >= 5 && lineHeightInFloor === Math.ceil((this.getHeightOf(currentFloor) - 2) / 2) ){
 				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
-				lines += this.generateLockLine(neededElements)
+				true
 			}
 			else {

[Timeout] BlockStatement
Development/Sastantua/src/Sastantua.ts:123:9
 				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
 				lines += this.generateLockLine(neededElements)
 			}
-			else {
-				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
-				lines += this.generateDoorLines(neededElements)
-			}
+			else {}
 		}
 		return lines

[Killed] UpdateOperator
Development/Sastantua/src/Sastantua.ts:124:45
 				lines += this.generateLockLine(neededElements)
 			}
 			else {
-				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
+				neededElements = this.getNeededElements(lineNumber--, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
 				lines += this.generateDoorLines(neededElements)
 			}

[Timeout] UpdateOperator
Development/Sastantua/src/Sastantua.ts:124:72
 				lines += this.generateLockLine(neededElements)
 			}
 			else {
-				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
+				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor++, currentFloor, LineType.DOOR)
 				lines += this.generateDoorLines(neededElements)
 			}

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:125:5
 			}
 			else {
 				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
-				lines += this.generateDoorLines(neededElements)
+				false
 			}
 		}

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:125:5
 			}
 			else {
 				neededElements = this.getNeededElements(lineNumber++, pyramidSize, lineHeightInFloor--, currentFloor, LineType.DOOR)
-				lines += this.generateDoorLines(neededElements)
+				true
 			}
 		}

[Killed] BlockStatement
Development/Sastantua/src/Sastantua.ts:131:54
 		return lines
 	}
 
-	private generateDoorLines(neededElements: Elements) {
-		return this.buildLine(LineType.DOOR, neededElements)
-	}
+	private generateDoorLines(neededElements: Elements) {}
 
 	private generateLockLine(neededElements: Elements) {

[Killed] BlockStatement
Development/Sastantua/src/Sastantua.ts:135:53
 		return this.buildLine(LineType.DOOR, neededElements)
 	}
 
-	private generateLockLine(neededElements: Elements) {
-		return this.buildLine(LineType.LOCK, neededElements)
-	}
+	private generateLockLine(neededElements: Elements) {}
 
 	private buildLine(lineType: string, neededElements: Elements) {

[Killed] BlockStatement
Development/Sastantua/src/Sastantua.ts:139:64
 		return this.buildLine(LineType.LOCK, neededElements)
 	}
 
-	private buildLine(lineType: string, neededElements: Elements) {
-		return this.accumulateElements(neededElements.spaces, this.SPACE) +
-			this.LEFT_SLOPE +
-			this.accumulateElements(neededElements.bricks, this.BRICK) +
-			this.accumulateElements(neededElements.door, this.DOOR) +
-			this.generateCentralElement(lineType) +
-			this.generateLock(neededElements, lineType) +
-			this.accumulateElements(neededElements.bricks, this.BRICK) +
-			this.RIGHT_SLOPE + this.NEW_LINE
-	}
+	private buildLine(lineType: string, neededElements: Elements) {}
 
 	private generateLock(neededElements: Elements, lineType: string) {

[Killed] BlockStatement
Development/Sastantua/src/Sastantua.ts:150:67
 			this.RIGHT_SLOPE + this.NEW_LINE
 	}
 
-	private generateLock(neededElements: Elements, lineType: string) {
-		const potentialLock = this.accumulateElements(neededElements.door, this.DOOR)
-		const LOCK_PATTERN = '$|'
-		if (lineType === LineType.LOCK)
-			return potentialLock.substr(0, potentialLock.length - 2) + LOCK_PATTERN
-		return potentialLock
-	}
+	private generateLock(neededElements: Elements, lineType: string) {}
 
 	private generateCentralElement(lineType: string) {
