[Killed] StringLiteral
Development/Sastantua/src/Sastantua.ts:152:24
 
 	private generateLock(neededElements: Elements, lineType: string) {
 		const potentialLock = this.accumulateElements(neededElements.door, this.DOOR)
-		const LOCK_PATTERN = '$|'
+		const LOCK_PATTERN = ""
 		if (lineType === LineType.LOCK)
 			return potentialLock.substr(0, potentialLock.length - 2) + LOCK_PATTERN

[Killed] EqualityOperator
Development/Sastantua/src/Sastantua.ts:153:16
 	private generateLock(neededElements: Elements, lineType: string) {
 		const potentialLock = this.accumulateElements(neededElements.door, this.DOOR)
 		const LOCK_PATTERN = '$|'
-		if (lineType === LineType.LOCK)
+		if (lineType !== LineType.LOCK)
 			return potentialLock.substr(0, potentialLock.length - 2) + LOCK_PATTERN
 		return potentialLock

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:153:7
 	private generateLock(neededElements: Elements, lineType: string) {
 		const potentialLock = this.accumulateElements(neededElements.door, this.DOOR)
 		const LOCK_PATTERN = '$|'
-		if (lineType === LineType.LOCK)
+		if (false)
 			return potentialLock.substr(0, potentialLock.length - 2) + LOCK_PATTERN
 		return potentialLock

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:154:56
 		const potentialLock = this.accumulateElements(neededElements.door, this.DOOR)
 		const LOCK_PATTERN = '$|'
 		if (lineType === LineType.LOCK)
-			return potentialLock.substr(0, potentialLock.length - 2) + LOCK_PATTERN
+			return potentialLock.substr(0, potentialLock.length + 2) + LOCK_PATTERN
 		return potentialLock
 	}

[Killed] BlockStatement
Development/Sastantua/src/Sastantua.ts:158:51
 		return potentialLock
 	}
 
-	private generateCentralElement(lineType: string) {
-		return (lineType === LineType.DOOR || lineType === LineType.LOCK) ? this.DOOR : this.BRICK
-	}
+	private generateCentralElement(lineType: string) {}
 
 	private accumulateElements(elementsNeeded: number, accumulator: string): string {

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:159:11
 	}
 
 	private generateCentralElement(lineType: string) {
-		return (lineType === LineType.DOOR || lineType === LineType.LOCK) ? this.DOOR : this.BRICK
+		return (false) ? this.DOOR : this.BRICK
 	}
 

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:159:11
 	}
 
 	private generateCentralElement(lineType: string) {
-		return (lineType === LineType.DOOR || lineType === LineType.LOCK) ? this.DOOR : this.BRICK
+		return (false || lineType === LineType.LOCK) ? this.DOOR : this.BRICK
 	}
 

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:164:7
 
 	private accumulateElements(elementsNeeded: number, accumulator: string): string {
 		const baseElement = accumulator.charAt(0)
-		if (elementsNeeded === 0)
+		if (true)
 			return ''
 		if (elementsNeeded === 1)

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:164:7
 
 	private accumulateElements(elementsNeeded: number, accumulator: string): string {
 		const baseElement = accumulator.charAt(0)
-		if (elementsNeeded === 0)
+		if (false)
 			return ''
 		if (elementsNeeded === 1)

[Killed] EqualityOperator
Development/Sastantua/src/Sastantua.ts:166:22
 		const baseElement = accumulator.charAt(0)
 		if (elementsNeeded === 0)
 			return ''
-		if (elementsNeeded === 1)
+		if (elementsNeeded !== 1)
 			return accumulator
 		return this.accumulateElements(elementsNeeded - 1, accumulator + baseElement)

[Killed] ConditionalExpression
Development/Sastantua/src/Sastantua.ts:166:7
 		const baseElement = accumulator.charAt(0)
 		if (elementsNeeded === 0)
 			return ''
-		if (elementsNeeded === 1)
+		if (false)
 			return accumulator
 		return this.accumulateElements(elementsNeeded - 1, accumulator + baseElement)

[Killed] ArithmeticOperator
Development/Sastantua/src/Sastantua.ts:168:49
 			return ''
 		if (elementsNeeded === 1)
 			return accumulator
-		return this.accumulateElements(elementsNeeded - 1, accumulator + baseElement)
+		return this.accumulateElements(elementsNeeded + 1, accumulator + baseElement)
 	}
 }
